danitns/stm32-odom-imu/Core/Inc/lsm9ds1_reg.h
#define LSM9DS1_INT_GEN_THS_ZH_G   0x35U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ths_g_z                  : 7;
  uint8_t not_used_01              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01              : 1;
  uint8_t ths_g_z                  : 7;
#endif /* DRV_BYTE_ORDER */
} lsm9ds1_int_gen_ths_zh_g_t;

#define LSM9DS1_INT_GEN_THS_ZL_G   0x36U
typedef struct
{
  uint8_t ths_g_z                  : 8;
} lsm9ds1_int_gen_ths_zl_g_t;
#define LSM9DS1_INT_GEN_DUR_G      0x37U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dur_g                    : 7;
  uint8_t wait_g                   : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t wait_g                   : 1;
  uint8_t dur_g                    : 7;
#endif /* DRV_BYTE_ORDER */
} lsm9ds1_int_gen_dur_g_t;

#define LSM9DS1_OFFSET_X_REG_L_M   0x05U
#define LSM9DS1_OFFSET_X_REG_H_M   0x06U
#define LSM9DS1_OFFSET_Y_REG_L_M   0x07U
#define LSM9DS1_OFFSET_Y_REG_H_M   0x08U
#define LSM9DS1_OFFSET_Z_REG_L_M   0x09U
#define LSM9DS1_OFFSET_Z_REG_H_M   0x0AU

#define LSM9DS1_WHO_AM_I_M         0x0FU
#define LSM9DS1_CTRL_REG1_M        0x20U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t st                       : 1;
  uint8_t fast_odr                 : 1;
  uint8_t _do                      : 3;
  uint8_t om                       : 2;
  uint8_t temp_comp                : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t temp_comp                : 1;
  uint8_t om                       : 2;
  uint8_t _do                      : 3;
  uint8_t fast_odr                 : 1;
  uint8_t st                       : 1;
#endif /* DRV_BYTE_ORDER */
} lsm9ds1_ctrl_reg1_m_t;

#define LSM9DS1_CTRL_REG2_M        0x21U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01              : 2;
  uint8_t soft_rst                 : 1;
  uint8_t reboot                   : 1;
  uint8_t not_used_02              : 1;
  uint8_t fs                       : 2;
  uint8_t not_used_03              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_03              : 1;
  uint8_t fs                       : 2;
  uint8_t not_used_02              : 1;
  uint8_t reboot                   : 1;
  uint8_t soft_rst                 : 1;
  uint8_t not_used_01              : 2;
#endif /* DRV_BYTE_ORDER */
} lsm9ds1_ctrl_reg2_m_t;

#define LSM9DS1_CTRL_REG3_M        0x22U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t md                       : 2;
  uint8_t sim                      : 1;
  uint8_t not_used_01              : 2;
  uint8_t lp                       : 1;
  uint8_t not_used_02              : 1;
  uint8_t i2c_disable              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t i2c_disable              : 1;
  uint8_t not_used_02              : 1;
  uint8_t lp                       : 1;
  uint8_t not_used_01              : 2;
  uint8_t sim                      : 1;
  uint8_t md                       : 2;
#endif /* DRV_BYTE_ORDER */
} lsm9ds1_ctrl_reg3_m_t;

#define LSM9DS1_CTRL_REG4_M        0x23U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01              : 1;
  uint8_t ble                      : 1;
  uint8_t omz                      : 2;
  uint8_t not_used_02              : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_02              : 4;
  uint8_t omz                      : 2;
  uint8_t ble                      : 1;
  uint8_t not_used_01              : 1;
#endif /* DRV_BYTE_ORDER */
} lsm9ds1_ctrl_reg4_m_t;

#define LSM9DS1_CTRL_REG5_M        0x24U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01              : 6;
  uint8_t bdu                      : 1;
  uint8_t fast_read                : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fast_read                : 1;
  uint8_t bdu                      : 1;
  uint8_t not_used_01              : 6;
#endif /* DRV_BYTE_ORDER */
} lsm9ds1_ctrl_reg5_m_t;

#define LSM9DS1_STATUS_REG_M       0x27U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xda                      : 1;
  uint8_t yda                      : 1;
  uint8_t zda                      : 1;
  uint8_t zyxda                    : 1;
  uint8_t _xor                     : 1;
  uint8_t yor                      : 1;
  uint8_t zor                      : 1;
  uint8_t zyxor                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t zyxor                    : 1;
  uint8_t zor                      : 1;
  uint8_t yor                      : 1;
  uint8_t _xor                     : 1;
  uint8_t zyxda                    : 1;
  uint8_t zda                      : 1;
  uint8_t yda                      : 1;
  uint8_t xda                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm9ds1_status_reg_m_t;

#define LSM9DS1_OUT_X_L_M          0x28U
#define LSM9DS1_OUT_X_H_M          0x29U
#define LSM9DS1_OUT_Y_L_M          0x2AU
#define LSM9DS1_OUT_Y_H_M          0x2BU
#define LSM9DS1_OUT_Z_L_M          0x2CU
#define LSM9DS1_OUT_Z_H_M          0x2DU
#define LSM9DS1_INT_CFG_M          0x30U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ien                      : 1;
  uint8_t iel                      : 1;
  uint8_t iea                      : 1;
  uint8_t not_used_01              : 2;
  uint8_t zien                     : 1;
  uint8_t yien                     : 1;
  uint8_t xien                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t xien                     : 1;
  uint8_t yien                     : 1;
  uint8_t zien                     : 1;
  uint8_t not_used_01              : 2;
  uint8_t iea                      : 1;
  uint8_t iel                      : 1;
  uint8_t ien                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm9ds1_int_cfg_m_t;

#define LSM9DS1_INT_SRC_M          0x31U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t _int                     : 1;
  uint8_t mroi                     : 1;
  uint8_t nth_z                    : 1;
  uint8_t nth_y                    : 1;
  uint8_t nth_x                    : 1;
  uint8_t pth_z                    : 1;
  uint8_t pth_y                    : 1;
  uint8_t pth_x                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t pth_x                    : 1;
  uint8_t pth_y                    : 1;
  uint8_t pth_z                    : 1;
  uint8_t nth_x                    : 1;
  uint8_t nth_y                    : 1;
  uint8_t nth_z                    : 1;
  uint8_t mroi                     : 1;
  uint8_t _int                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm9ds1_int_src_m_t;

#define LSM9DS1_INT_THS_L_M        0x32U
typedef struct
{
  uint8_t ths                      : 8;
} lsm9ds1_int_ths_l_m_t;

#define LSM9DS1_INT_THS_H_M        0x33U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ths                      : 7;
  uint8_t not_used_01              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01              : 1;
  uint8_t ths                      : 7;
#endif /* DRV_BYTE_ORDER */
} lsm9ds1_int_ths_h_m_t;

/**
  * @defgroup LSM9DS1_Register_Union
  * @brief    This union group all the registers having a bit-field
  *           description.
  *           This union is useful but it's not needed by the driver.
  *
  *           REMOVING this union you are compliant with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */
typedef union
{
  lsm9ds1_act_ths_t                act_ths;
  lsm9ds1_int_gen_cfg_xl_t         int_gen_cfg_xl;
  lsm9ds1_int_gen_dur_xl_t         int_gen_dur_xl;
  lsm9ds1_int1_ctrl_t              int1_ctrl;
  lsm9ds1_int2_ctrl_t              int2_ctrl;
  lsm9ds1_ctrl_reg1_g_t            ctrl_reg1_g;
  lsm9ds1_ctrl_reg2_g_t            ctrl_reg2_g;
  lsm9ds1_ctrl_reg3_g_t            ctrl_reg3_g;
  lsm9ds1_orient_cfg_g_t           orient_cfg_g;
  lsm9ds1_int_gen_src_g_t          int_gen_src_g;
  lsm9ds1_status_reg_t             status_reg;
  lsm9ds1_ctrl_reg4_t              ctrl_reg4;
  lsm9ds1_ctrl_reg5_xl_t           ctrl_reg5_xl;
  lsm9ds1_ctrl_reg6_xl_t           ctrl_reg6_xl;
  lsm9ds1_ctrl_reg7_xl_t           ctrl_reg7_xl;
  lsm9ds1_ctrl_reg8_t              ctrl_reg8;
  lsm9ds1_ctrl_reg9_t              ctrl_reg9;
  lsm9ds1_ctrl_reg10_t             ctrl_reg10;
  lsm9ds1_int_gen_src_xl_t         int_gen_src_xl;
  lsm9ds1_fifo_ctrl_t              fifo_ctrl;
  lsm9ds1_fifo_src_t               fifo_src;
  lsm9ds1_int_gen_cfg_g_t          int_gen_cfg_g;
  lsm9ds1_int_gen_ths_xh_g_t       int_gen_ths_xh_g;
  lsm9ds1_int_gen_ths_xl_g_t       int_gen_ths_xl_g;
  lsm9ds1_int_gen_ths_yh_g_t       int_gen_ths_yh_g;
  lsm9ds1_int_gen_ths_yl_g_t       int_gen_ths_yl_g;
  lsm9ds1_int_gen_ths_zh_g_t       int_gen_ths_zh_g;
  lsm9ds1_int_gen_ths_zl_g_t       int_gen_ths_zl_g;
  lsm9ds1_int_gen_dur_g_t          int_gen_dur_g;
  lsm9ds1_ctrl_reg1_m_t            ctrl_reg1_m;
  lsm9ds1_ctrl_reg2_m_t            ctrl_reg2_m;
  lsm9ds1_ctrl_reg3_m_t            ctrl_reg3_m;
  lsm9ds1_ctrl_reg4_m_t            ctrl_reg4_m;
  lsm9ds1_ctrl_reg5_m_t            ctrl_reg5_m;
  lsm9ds1_status_reg_m_t           status_reg_m;
  lsm9ds1_int_cfg_m_t              int_cfg_m;
  lsm9ds1_int_src_m_t              int_src_m;
  lsm9ds1_int_ths_l_m_t            int_ths_l_m;
  lsm9ds1_int_ths_h_m_t            int_ths_h_m;
  bitwise_t                        bitwise;
  uint8_t                          byte;
} lsm9ds1_reg_t;

/**
  * @}
  *
  */

int32_t lsm9ds1_read_reg(stmdev_ctx_t *ctx, uint8_t reg,
                         uint8_t *data,
                         uint16_t len);
int32_t lsm9ds1_write_reg(stmdev_ctx_t *ctx, uint8_t reg,
                          uint8_t *data,
                          uint16_t len);

float_t lsm9ds1_from_fs2g_to_mg(int16_t lsb);
float_t lsm9ds1_from_fs4g_to_mg(int16_t lsb);
float_t lsm9ds1_from_fs8g_to_mg(int16_t lsb);
float_t lsm9ds1_from_fs16g_to_mg(int16_t lsb);

float_t lsm9ds1_from_fs245dps_to_mdps(int16_t lsb);
float_t lsm9ds1_from_fs500dps_to_mdps(int16_t lsb);
float_t lsm9ds1_from_fs2000dps_to_mdps(int16_t lsb);

float_t lsm9ds1_from_fs4gauss_to_mG(int16_t lsb);
float_t lsm9ds1_from_fs8gauss_to_mG(int16_t lsb);
float_t lsm9ds1_from_fs12gauss_to_mG(int16_t lsb);
float_t lsm9ds1_from_fs16gauss_to_mG(int16_t lsb);

