danitns/stm32-odom-imu/Core/Inc/lsm9ds1_reg.h
typedef enum
{
  LSM9DS1_RESET_MODE = 0,
  LSM9DS1_DECREMENT_MODE = 1,
} lsm9ds1_dcrm_g_t;
int32_t lsm9ds1_gy_trshld_mode_set(stmdev_ctx_t *ctx,
                                   lsm9ds1_dcrm_g_t val);
int32_t lsm9ds1_gy_trshld_mode_get(stmdev_ctx_t *ctx,
                                   lsm9ds1_dcrm_g_t *val);

int32_t lsm9ds1_gy_trshld_x_set(stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm9ds1_gy_trshld_x_get(stmdev_ctx_t *ctx, uint16_t *val);

int32_t lsm9ds1_gy_trshld_y_set(stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm9ds1_gy_trshld_y_get(stmdev_ctx_t *ctx, uint16_t *val);

int32_t lsm9ds1_gy_trshld_z_set(stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm9ds1_gy_trshld_z_get(stmdev_ctx_t *ctx, uint16_t *val);

int32_t lsm9ds1_gy_trshld_min_sample_set(stmdev_ctx_t *ctx,
                                         uint8_t val);
int32_t lsm9ds1_gy_trshld_min_sample_get(stmdev_ctx_t *ctx,
                                         uint8_t *val);

typedef struct
{
  uint8_t zien             : 1;
  uint8_t yien             : 1;
  uint8_t xien             : 1;
} lsm9ds1_mag_trshld_axis_t;
int32_t lsm9ds1_mag_trshld_axis_set(stmdev_ctx_t *ctx,
                                    lsm9ds1_mag_trshld_axis_t val);
int32_t lsm9ds1_mag_trshld_axis_get(stmdev_ctx_t *ctx,
                                    lsm9ds1_mag_trshld_axis_t *val);
typedef struct
{
  uint8_t _int              : 1;
  uint8_t nth_z             : 1;
  uint8_t nth_y             : 1;
  uint8_t nth_x             : 1;
  uint8_t pth_z             : 1;
  uint8_t pth_y             : 1;
  uint8_t pth_x             : 1;
} lsm9ds1_mag_trshld_src_t;
int32_t lsm9ds1_mag_trshld_src_get(stmdev_ctx_t *ctx,
                                   lsm9ds1_mag_trshld_src_t *val);

int32_t lsm9ds1_mag_trshld_set(stmdev_ctx_t *ctx, uint8_t *val);
int32_t lsm9ds1_mag_trshld_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm9ds1_act_threshold_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm9ds1_act_threshold_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM9DS1_GYRO_POWER_DOWN = 0,
  LSM9DS1_GYRO_SLEEP = 1,
} lsm9ds1_act_mode_t;
int32_t lsm9ds1_act_mode_set(stmdev_ctx_t *ctx,
                             lsm9ds1_act_mode_t val);
int32_t lsm9ds1_act_mode_get(stmdev_ctx_t *ctx,
                             lsm9ds1_act_mode_t *val);

int32_t lsm9ds1_act_duration_set(stmdev_ctx_t *ctx, uint8_t *buff);
int32_t lsm9ds1_act_duration_get(stmdev_ctx_t *ctx, uint8_t *buff);

typedef enum
{
  LSM9DS1_ACTIVITY    = 0,
  LSM9DS1_INACTIVITY  = 1,
} lsm9ds1_inact_t;
int32_t lsm9ds1_act_src_get(stmdev_ctx_t *ctx, lsm9ds1_inact_t *val);

typedef enum
{
  LSM9DS1_POS_MOVE_RECO_DISABLE   = 0x00,
  LSM9DS1_6D_MOVE_RECO            = 0x01,
  LSM9DS1_4D_MOVE_RECO            = 0x05,
  LSM9DS1_6D_POS_RECO             = 0x03,
  LSM9DS1_4D_POS_RECO             = 0x07,
} lsm9ds1_6d_mode_t;
int32_t lsm9ds1_6d_mode_set(stmdev_ctx_t *ctx, lsm9ds1_6d_mode_t val);
int32_t lsm9ds1_6d_mode_get(stmdev_ctx_t *ctx,
                            lsm9ds1_6d_mode_t *val);

int32_t lsm9ds1_6d_threshold_set(stmdev_ctx_t *ctx, uint8_t *buff);
int32_t lsm9ds1_6d_threshold_get(stmdev_ctx_t *ctx, uint8_t *buff);

typedef struct
{
  uint8_t xl_xl             : 1;
  uint8_t xh_xl             : 1;
  uint8_t yl_xl             : 1;
  uint8_t yh_xl             : 1;
  uint8_t zl_xl             : 1;
  uint8_t zh_xl             : 1;
  uint8_t ia_xl             : 1;
} lsm9ds1_6d_src_t;
int32_t lsm9ds1_6d_src_get(stmdev_ctx_t *ctx, lsm9ds1_6d_src_t *val);

int32_t lsm9ds1_fifo_stop_on_wtm_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm9ds1_fifo_stop_on_wtm_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM9DS1_FIFO_OFF                = 0x00,
  LSM9DS1_BYPASS_MODE             = 0x10,
  LSM9DS1_FIFO_MODE               = 0x11,
  LSM9DS1_STREAM_TO_FIFO_MODE     = 0x13,
  LSM9DS1_BYPASS_TO_STREAM_MODE   = 0x14,
  LSM9DS1_STREAM_MODE             = 0x16,
} lsm9ds1_fifo_md_t;

int32_t platform_write(void *handle, uint8_t Reg, const uint8_t *Bufp, uint16_t len);
int32_t platform_read(void *handle, uint8_t Reg, uint8_t *Bufp, uint16_t len);

int32_t lsm9ds1_fifo_mode_set(stmdev_ctx_t *ctx,
                              lsm9ds1_fifo_md_t val);
int32_t lsm9ds1_fifo_mode_get(stmdev_ctx_t *ctx,
                              lsm9ds1_fifo_md_t *val);

int32_t lsm9ds1_fifo_temp_batch_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm9ds1_fifo_temp_batch_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm9ds1_fifo_watermark_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm9ds1_fifo_watermark_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm9ds1_fifo_full_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm9ds1_fifo_data_level_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm9ds1_fifo_ovr_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm9ds1_fifo_wtm_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm9ds1_xl_self_test_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm9ds1_xl_self_test_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm9ds1_gy_self_test_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm9ds1_gy_self_test_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm9ds1_mag_self_test_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm9ds1_mag_self_test_get(stmdev_ctx_t *ctx, uint8_t *val);
/**
  *@}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* LSM9DS1_REGS_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
